s = "юПдПцТХи!ЗчЦн!дкРХ?!ЬЭЦРХх*у?ЮЮП]РвЭ:ЭэСУЧЦе$ГяР~!зЩПю:ПЭЫКЫЗв$Ф_~ЮПЭэЬНДПЧлЦШЙлюфъ~ЮЧкЦЭШЙЩЪ!ТЛшрфГшРЦб]ЭбН=ЧЦЭЗшшКтЫъ~ЮкжСзЪ5ФэУКШП*#ХтЫЩ!лФЯН:ПШЧ$чХкъфяХ\"СкЮПл?яэЩУЙЛЭ?Е?ЪЯЫжМбаЮСбЭЙОЩ*~СшШЬЭвэжТ8ЭОФПцшмчУчзСб]ЭСЫ5ЫэЯУКПпчО_Ь#!ИЪЮЭ;аЮвцЙХЯ!У_!\"ЭжФ!ЫДФЩлцХТл(Лч\"\"АзЦЯН?!у(!ъш0Л!?УФ~]РЭю:~эмчо"
a= "Молодежь_в_прошлом"
alfavit="!~\"#$%&()[]{}\\*+,_./0123456789:;<=>?АБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдежзийклмнопрстуфхцчшщъыьэюя"
massiv = ""

for i in range(len(s)):
    Ind = i
    while Ind >= len(a):
        Ind = Ind - len(a)
    chislo = (alfavit.index(s[i]) + 1) - (alfavit.index(a[Ind]) + 1)
    if chislo <= 0:
        chislo = chislo + 100
    massiv = massiv + alfavit[chislo - 1]

print(massiv)
